app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "123@yahoo.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at", "password_hash", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    is_user = User.find_by_email(params[:email])
    if !is_user
      @user = User.new(params[:user])
      @user.password = params[:password]
      @user.email = params[:email]
      @user.name = params[:name]
      @user.save!

SELECT "users".* FROM "users"
---
  def show_all
     user_all = User.all